Lab4-CacheLab/report/CACHELAB.org
#+TITLE: 计算机系统基础(下)实验报告-Cache Lab
#+Author: 何岩, 199074277 

* 说明
  :PROPERTIES:
  :CUSTOM_ID: 说明
  :END:
1. 请提交该文件生成的HTML文件, 生成快捷键为 C-c C-e h h.
2. HTML文件名格式: cachelab-2020-179074123-李雷.html

* 解题思路的文字说明
  :PROPERTIES:
  :CUSTOM_ID: 解题思路的文字说明
  :END:
** Part A: Writing a Cache Simulator
   :PROPERTIES:
   :CUSTOM_ID: part-a-writing-a-cache-simulator
   :END:
在A部分中，我们要在csim.c中编写一个缓存模拟器，该模拟器以valgrind内存跟踪为输入，在该跟踪上模拟缓存的命中/未命中行为，并输出命中，未命中和逐出的总数。

我们提供了参考缓存模拟器的二进制可执行文件，称为csim-ref，它可在valgrind跟踪文件上模拟具有任意大小和关联性的缓存行为。它使用LRU替换策略选择出需要的缓存行。

*** Cache 结构
    :PROPERTIES:
    :CUSTOM_ID: cache-结构
    :END:
设计Cache基本单元为 block，cache由cacheblock组成

#+begin_src C
  typedef struct 
  {
      unsigned tag;
      unsigned usedtime;
  } block;
  block *cache;
#+end_src

其中usedtime是判断LRU
cache行。初始值为0表示没有用过，相当于invalid。非零值越小代表越少使用，usedtime最大代表刚使用。

*** 命令行参数解析
    :PROPERTIES:
    :CUSTOM_ID: 命令行参数解析
    :END:
阅读官方给的文档，可以知道我们需要完善如下这些命令行参数

#+begin_src shell
  Usage: ./csim-ref [-hv] -s <s> -E <E> -b <b> -t <tracefile>
  • -h: Optional help flag that prints usage info
  • -v: Optional verbose flag that displays trace info
  • -s <s>: Number of set index bits (S = 2s is the number of sets)
  • -E <E>: Associativity (number of lines per set)
  • -b <b>: Number of block bits (B = 2b is the block size)
  • -t <tracefile>: Name of the valgrind trace to replay
#+end_src

具体代码如下：

#+begin_src C
  while ((opt = getopt(argc, argv, "hvs:E:b:t:")) != -1)
  {
      switch (opt)
      {
      case 'h':
          print_usage();
          exit(0);
      case 'v':
          // v = 1;
          break;
      case 's':
          s = atoi(optarg);
          break;
      case 'E':
          E = atoi(optarg);
          break;
      case 'b':
          b = atoi(optarg);
          break;
      case 't':
          f = fopen(optarg, "r");
          break;
      }
  }
#+end_src

*** 初始化 Cache
    :PROPERTIES:
    :CUSTOM_ID: 初始化-cache
    :END:
#+begin_src C
  cache = (block *)malloc(sizeof(block) * E << s);
  memset(cache, 0, sizeof(block) * E << s);
#+end_src

*** 读取文件参数
    :PROPERTIES:
    :CUSTOM_ID: 读取文件参数
    :END:
利用fscanf读取trace文件中的指令、地址

#+begin_src C
  while (fscanf(f, "%s%x,%*d\n", &op, &addr) > 0)
  {
      switch (op)
      {
      case 'M':
          hit++;
      case 'L':
      case 'S':
          find(addr, ++t);
      }
  }
#+end_src

*** 数据访问
    :PROPERTIES:
    :CUSTOM_ID: 数据访问
    :END:
获取=tag=和 =set index=同时找到对应的=row=

#+begin_src C
  unsigned tag = addr >> b >> s;
  int setindex = addr >> b ^ (tag << s);
  block *cacherow = cache + E * setindex;
  block *evictionrow = cacherow;
#+end_src

进行数据查找，其中evictionrow表示查询过程中LRU的cache行，也就是usedtime最小的（但是非0）在一个set里面遍历cache行

- 如果usedtime！=0且tag匹配：hit
- 如果usedtime=0，是个空block，使用这个block：miss
- 如果usedtime！=0，tag不匹配，跟evictionrow.usedtime比较，如果时间更小，更新evictionrow=该cacheblock

如果循环结束，也就证明这个set的所有cache行都满了，就替换LRU
cache行。具体代码如下：

#+begin_src C
  void find(unsigned addr, int time)
  {
      unsigned tag = addr >> b >> s;
      int setindex = addr >> b ^ (tag << s);
      block *cacherow = cache + E * setindex;
      block *evictionrow = cacherow;
      for (int i = 0; i < E; i++)
      {
          if (cacherow[i].usedtime && cacherow[i].tag == tag)
          {
              cacherow[i].usedtime = time;
              hit++;
              return;
          }
          else if (!cacherow[i].usedtime)
          {
              miss++;
              cacherow[i].usedtime = time;
              cacherow[i].tag = tag;
              return;
          }
          else if (cacherow[i].usedtime < evictionrow->usedtime)
              evictionrow = cacherow + i;
      }
      miss++;
      eviction++;
      evictionrow->usedtime = time;
      evictionrow->tag = tag;
  }
#+end_src

至此，Cache Simulator设计完成，完整代码见下面。

** Part B：Optimizing Matrix Transpose
   :PROPERTIES:
   :CUSTOM_ID: part-boptimizing-matrix-transpose
   :END:
在B部分中，我们将在trans.c中编写一个转置函数，该函数将尽可能降低高速缓存未命中率。需要注意的是，文档中规定了以下几点注意事项：

1. 代码必须在没有警告的情况下进行编译才能获得分数。
2. 每个转置函数最多可以定义12个int类型的局部变量。
3. 不允许使用long类型的任何变量或使用任何位技巧将多个以上的值存储到单个变量中来避开上一条规则。
4. 转置函数不能使用递归。
5. 如果选择使用辅助函数，则在辅助函数和顶级转置函数之间的某个时间堆栈上最多可以包含12个局部变量。例如，如果您的转置声明了8个变量，然后调用了一个使用4个变量的函数，然后调用了另一个使用2个变量的函数，则堆栈中将有14个变量，这将违反规则。
6. 您的转置函数可能不会修改数组A。但是，您可以对数组B的内容做任何想做的事情。
7. 您不允许在代码中定义任何数组或使用malloc的任何变体。

