Lab4-CacheLab/report/CACHELAB.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-21 Thu 08:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>计算机系统基础(下)实验报告-Cache Lab</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="何岩, 199074277" />
</head>
<body>
<div id="content">
<h1 class="title">计算机系统基础(下)实验报告-Cache Lab</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#说明">1. 说明</a></li>
<li><a href="#解题思路的文字说明">2. 解题思路的文字说明</a>
<ul>
<li><a href="#part-a-writing-a-cache-simulator">2.1. Part A: Writing a Cache Simulator</a>
<ul>
<li><a href="#cache-结构">2.1.1. Cache 结构</a></li>
<li><a href="#命令行参数解析">2.1.2. 命令行参数解析</a></li>
<li><a href="#初始化-cache">2.1.3. 初始化 Cache</a></li>
<li><a href="#读取文件参数">2.1.4. 读取文件参数</a></li>
<li><a href="#数据访问">2.1.5. 数据访问</a></li>
</ul>
</li>
<li><a href="#part-boptimizing-matrix-transpose">2.2. Part B：Optimizing Matrix Transpose</a>
<ul>
<li><a href="#m-32-n-32">2.2.1. 32 × 32 (M = 32, N = 32)</a></li>
<li><a href="#m-64-n-64">2.2.2. 64 × 64 (M = 64, N = 64)</a></li>
<li><a href="#m-61-n-67">2.2.3. 61 × 67 (M = 61, N = 67)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#代码">3. 代码</a>
<ul>
<li><a href="#part-a-writing-a-cache-simulator-1">3.1. Part A: Writing a Cache Simulator</a></li>
<li><a href="#part-boptimizing-matrix-transpose-1">3.2. Part B：Optimizing Matrix Transpose</a></li>
</ul>
</li>
<li><a href="#运行结果与分析">4. 运行结果与分析</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgefd99cc" class="outline-2">
<h2 id="说明"><a id="orgefd99cc"></a><span class="section-number-2">1</span> 说明</h2>
<div class="outline-text-2" id="text-说明">
<ol class="org-ol">
<li>请提交该文件生成的HTML文件, 生成快捷键为 C-c C-e h h.</li>
<li>HTML文件名格式: cachelab-2020-179074123-李雷.html</li>
</ol>
</div>
</div>

<div id="outline-container-orga896840" class="outline-2">
<h2 id="解题思路的文字说明"><a id="orga896840"></a><span class="section-number-2">2</span> 解题思路的文字说明</h2>
<div class="outline-text-2" id="text-解题思路的文字说明">
</div>
<div id="outline-container-orgec32129" class="outline-3">
<h3 id="part-a-writing-a-cache-simulator"><a id="orgec32129"></a><span class="section-number-3">2.1</span> Part A: Writing a Cache Simulator</h3>
<div class="outline-text-3" id="text-part-a-writing-a-cache-simulator">
<p>
在A部分中，我们要在csim.c中编写一个缓存模拟器，该模拟器以valgrind内存跟踪为输入，在该跟踪上模拟缓存的命中/未命中行为，并输出命中，未命中和逐出的总数。
</p>

<p>
我们提供了参考缓存模拟器的二进制可执行文件，称为csim-ref，它可在valgrind跟踪文件上模拟具有任意大小和关联性的缓存行为。它使用LRU替换策略选择出需要的缓存行。
</p>
</div>

<div id="outline-container-orgfa378c4" class="outline-4">
<h4 id="cache-结构"><a id="orgfa378c4"></a><span class="section-number-4">2.1.1</span> Cache 结构</h4>
<div class="outline-text-4" id="text-cache-结构">
<p>
设计Cache基本单元为 block，cache由cacheblock组成
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> 
{
    <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">tag</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">usedtime</span>;
} <span style="color: #228b22;">block</span>;
<span style="color: #228b22;">block</span> *<span style="color: #a0522d;">cache</span>;
</pre>
</div>

<p>
其中usedtime是判断LRU
cache行。初始值为0表示没有用过，相当于invalid。非零值越小代表越少使用，usedtime最大代表刚使用。
</p>
</div>
</div>

<div id="outline-container-orgdb95d15" class="outline-4">
<h4 id="命令行参数解析"><a id="orgdb95d15"></a><span class="section-number-4">2.1.2</span> 命令行参数解析</h4>
<div class="outline-text-4" id="text-命令行参数解析">
<p>
阅读官方给的文档，可以知道我们需要完善如下这些命令行参数
</p>

<div class="org-src-container">
<pre class="src src-shell">Usage: ./csim-ref [-hv] -s &lt;s&gt; -E &lt;E&gt; -b &lt;b&gt; -t &lt;tracefile&gt;
&#8226; -h: Optional help flag that prints usage info
&#8226; -v: Optional verbose flag that displays trace info
&#8226; -s &lt;s&gt;: Number of set index bits (<span style="color: #a0522d;">S</span> = 2s is the number of sets)
&#8226; -E &lt;E&gt;: Associativity (number of lines per set)
&#8226; -b &lt;b&gt;: Number of block bits (<span style="color: #a0522d;">B</span> = 2b is the block size)
&#8226; -t &lt;tracefile&gt;: Name of the valgrind trace to replay
</pre>
</div>

<p>
具体代码如下：
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #a020f0;">while</span> ((opt = getopt(argc, argv, <span style="color: #8b2252;">"hvs:E:b:t:"</span>)) != -1)
{
    <span style="color: #a020f0;">switch</span> (opt)
    {
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'h'</span>:
        print_usage();
        exit(0);
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'v'</span>:
        <span style="color: #b22222;">// </span><span style="color: #b22222;">v = 1;</span>
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'s'</span>:
        s = atoi(optarg);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'E'</span>:
        E = atoi(optarg);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'b'</span>:
        b = atoi(optarg);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'t'</span>:
        f = fopen(optarg, <span style="color: #8b2252;">"r"</span>);
        <span style="color: #a020f0;">break</span>;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org38a8045" class="outline-4">
<h4 id="初始化-cache"><a id="org38a8045"></a><span class="section-number-4">2.1.3</span> 初始化 Cache</h4>
<div class="outline-text-4" id="text-初始化-cache">
<div class="org-src-container">
<pre class="src src-C">cache = (<span style="color: #228b22;">block</span> *)malloc(<span style="color: #a020f0;">sizeof</span>(block) * E &lt;&lt; s);
<span style="color: #0000ff;">memset</span>(cache, 0, <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">block</span>) * E &lt;&lt; s);
</pre>
</div>
</div>
</div>

<div id="outline-container-org00a1f04" class="outline-4">
<h4 id="读取文件参数"><a id="org00a1f04"></a><span class="section-number-4">2.1.4</span> 读取文件参数</h4>
<div class="outline-text-4" id="text-读取文件参数">
<p>
利用fscanf读取trace文件中的指令、地址
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #a020f0;">while</span> (fscanf(f, <span style="color: #8b2252;">"%s%x,%*d\n"</span>, &amp;op, &amp;addr) &gt; 0)
{
    <span style="color: #a020f0;">switch</span> (op)
    {
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'M'</span>:
        hit++;
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'L'</span>:
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'S'</span>:
        find(addr, ++t);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org24baa5b" class="outline-4">
<h4 id="数据访问"><a id="org24baa5b"></a><span class="section-number-4">2.1.5</span> 数据访问</h4>
<div class="outline-text-4" id="text-数据访问">
<p>
获取=tag=和 <code>set index=同时找到对应的=row</code>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">tag</span> = addr &gt;&gt; b &gt;&gt; s;
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">setindex</span> = addr &gt;&gt; b ^ (tag &lt;&lt; s);
<span style="color: #228b22;">block</span> *<span style="color: #a0522d;">cacherow</span> = cache + E * setindex;
<span style="color: #228b22;">block</span> *<span style="color: #a0522d;">evictionrow</span> = cacherow;
</pre>
</div>

<p>
进行数据查找，其中evictionrow表示查询过程中LRU的cache行，也就是usedtime最小的（但是非0）在一个set里面遍历cache行
</p>

<ul class="org-ul">
<li>如果usedtime！=0且tag匹配：hit</li>
<li>如果usedtime=0，是个空block，使用这个block：miss</li>
<li>如果usedtime！=0，tag不匹配，跟evictionrow.usedtime比较，如果时间更小，更新evictionrow=该cacheblock</li>
</ul>

<p>
如果循环结束，也就证明这个set的所有cache行都满了，就替换LRU
cache行。具体代码如下：
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">find</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">addr</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">time</span>)
{
    <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">tag</span> = addr &gt;&gt; b &gt;&gt; s;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">setindex</span> = addr &gt;&gt; b ^ (tag &lt;&lt; s);
    <span style="color: #228b22;">block</span> *<span style="color: #a0522d;">cacherow</span> = cache + E * setindex;
    <span style="color: #228b22;">block</span> *<span style="color: #a0522d;">evictionrow</span> = cacherow;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0; i &lt; E; i++)
    {
        <span style="color: #a020f0;">if</span> (cacherow[i].usedtime &amp;&amp; cacherow[i].tag == tag)
        {
            cacherow[i].usedtime = time;
            hit++;
            <span style="color: #a020f0;">return</span>;
        }
        <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (!cacherow[i].usedtime)
        {
            miss++;
            cacherow[i].usedtime = time;
            cacherow[i].tag = tag;
            <span style="color: #a020f0;">return</span>;
        }
        <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (cacherow[i].usedtime &lt; evictionrow-&gt;usedtime)
            evictionrow = cacherow + i;
    }
    miss++;
    eviction++;
    evictionrow-&gt;usedtime = time;
    evictionrow-&gt;tag = tag;
}
</pre>
</div>

<p>
至此，Cache Simulator设计完成，完整代码见下面。
</p>
</div>
</div>
</div>

<div id="outline-container-org893c79e" class="outline-3">
<h3 id="part-boptimizing-matrix-transpose"><a id="org893c79e"></a><span class="section-number-3">2.2</span> Part B：Optimizing Matrix Transpose</h3>
<div class="outline-text-3" id="text-part-boptimizing-matrix-transpose">
<p>
在B部分中，我们将在trans.c中编写一个转置函数，该函数将尽可能降低高速缓存未命中率。需要注意的是，文档中规定了以下几点注意事项：
</p>

<ol class="org-ol">
<li>代码必须在没有警告的情况下进行编译才能获得分数。</li>
<li>每个转置函数最多可以定义12个int类型的局部变量。</li>
<li>不允许使用long类型的任何变量或使用任何位技巧将多个以上的值存储到单个变量中来避开上一条规则。</li>
<li>转置函数不能使用递归。</li>
<li>如果选择使用辅助函数，则在辅助函数和顶级转置函数之间的某个时间堆栈上最多可以包含12个局部变量。例如，如果您的转置声明了8个变量，然后调用了一个使用4个变量的函数，然后调用了另一个使用2个变量的函数，则堆栈中将有14个变量，这将违反规则。</li>
<li>您的转置函数可能不会修改数组A。但是，您可以对数组B的内容做任何想做的事情。</li>
<li>您不允许在代码中定义任何数组或使用malloc的任何变体。</li>
</ol>
</div>
