Lab4-CacheLab/report/CACHELAB.org
*** 32 × 32 (M = 32, N = 32)
    :PROPERTIES:
    :CUSTOM_ID: m-32-n-32
    :END:
32 × 32: 8 points if m < 300, 0 points if m > 600

对于32 * 32的矩阵，一次可以装下8行的值。于是用8 *
8的分块来处理，增加缓存命中。为了避免矩阵对角线访问问题，通过变量一次性读出A的一整行，再存入B。代码如下：

#+begin_src C
  for (i = 0; i < N; i += 8) {
      for (j = 0; j < M; j += 8) {
          if (i == j) {
              for (k = i; k < i + 8 && k < N; k++) {
                  a0 = A[k][j];
                  a1 = A[k][j + 1];
                  a2 = A[k][j + 2];
                  a3 = A[k][j + 3];
                  a4 = A[k][j + 4];
                  a5 = A[k][j + 5];
                  a6 = A[k][j + 6];
                  a7 = A[k][j + 7];
                  B[k][j] = a0;
                  B[k][j + 1] = a1;
                  B[k][j + 2] = a2;
                  B[k][j + 3] = a3;
                  B[k][j + 4] = a4;
                  B[k][j + 5] = a5;
                  B[k][j + 6] = a6;
                  B[k][j + 7] = a7;
              }
              for (k = i; k < i + 8 && k < N; k++) {
                  for (l = k; l < j + 8 && l < M; l++) {
                      a0 = B[l][k];
                      B[l][k] = B[k][l];
                      B[k][l] = a0;
                  }
              }
          } else {
              for (k = i; k < i + 8 && k < N; k++) {
                  for (l = j; l < j + 8 && l < M; l++) {
                      B[l][k] = A[k][l];
                  }
              }
          }
      }
  }
#+end_src

*** 64 × 64 (M = 64, N = 64)
    :PROPERTIES:
    :CUSTOM_ID: m-64-n-64
    :END:
64 × 64: 8 points if m < 1, 300, 0 points if m > 2, 000

还是考虑 8 * 8 分块的情况，不过这一次是在分块内再次分块成 4 个 4 * 4 分
块，分别处理这 4 个分块。

首先对左上角和右上角进行处理：

1. B左上角 = A左上角转置。B右上角=A右上角转置。
2. 我们最后只需要把这部分平移到B的左下角就好。

现在B左上角完成

1. 首先用四个变量存储A的左下角的一列。
2. 再用四个变量存储B的右上角的一行。
3. 把四个变量存储的A的左下角的一列移动到B右上角的一行
4. 把四个变量存储的B的右上角的一行平移到B左下角的一列
5. B的右下角=A的右下角转置

#+begin_src C
  for (j = 0; j < M; j += 8) {
      i = !(j >> 5) << 5;
      for (l = j; l < j + 8 && l < M; l++)
          for (k = j; k < j + 4 && k < N; k++)
              B[k][i + l - j] = A[k][l];
      for (l = j; l < j + 8 && l < M; l++)
          for (k = j + 4; k < j + 8 && k < N; k++)
              B[k - 4][i + l - j + 8] = A[k][l];
      for (l = j; l < j + 4 && l < M; l++) {
          for (k = j; k < j + 4 && k < N; k++)
              B[l][k] = B[k][i + l - j];
          for (k = j + 4; k < j + 8 && k < N; k++)
              B[l][k] = B[k - 4][i + l - j + 8];
      }
      for (l = j + 4; l < j + 8 && l < M; l++) {
          for (k = j; k < j + 4 && k < N; k++)
              B[l][k] = B[k][i + l - j];
          for (k = j + 4; k < j + 8 && k < N; k++)
              B[l][k] = B[k - 4][i + l - j + 8];
      }
      for (i = 0; i < N; i += 8) {
          if (i != j) {
              for (k = i; k < i + 2 && k < N; k++)
                  for (l = j; l < j + 4 && l < M; l++)
                      B[l][k] = A[k][l];
              a0 = A[i][j + 4];
              a1 = A[i][j + 5];
              a2 = A[i][j + 6];
              a3 = A[i][j + 7];
              a4 = A[i + 1][j + 4];
              a5 = A[i + 1][j + 5];
              a6 = A[i + 1][j + 6];
              a7 = A[i + 1][j + 7];
              for (k = i + 2; k < i + 4 && k < N; k++) {
                  for (l = j; l < j + 4 && l < M; l++)
                      B[l][k] = A[k][l];
                  for (l = j + 4; l < j + 8 && l < M; l++)
                      B[k - i + j][l - j + i] = A[k][l];
              }
              for (k = i + 4; k < i + 8 && k < N; k++)
                  for (l = j; l < j + 2 && l < M; l++)
                      B[l][k] = A[k][l];
              for (k = i + 2; k < i + 4 && k < N; k++)
                  for (l = j + 4; l < j + 6 && l < M; l++)
                      B[l][k] = B[k - i + j][l - j + i];
              B[j + 4][i] = a0;
              B[j + 5][i] = a1;
              B[j + 4][i + 1] = a4;
              B[j + 5][i + 1] = a5;
              a0 = B[j + 2][i + 6];
              a1 = B[j + 2][i + 7];
              a4 = B[j + 3][i + 6];
              a5 = B[j + 3][i + 7];
              for (k = i + 4; k < i + 8 && k < N; k++)
                  for (l = j + 2; l < j + 4 && l < M; l++)
                      B[l][k] = A[k][l];
              B[j + 6][i] = a2;
              B[j + 7][i] = a3;
              B[j + 6][i + 1] = a6;
              B[j + 7][i + 1] = a7;
              B[j + 6][i + 2] = a0;
              B[j + 7][i + 2] = a1;
              B[j + 6][i + 3] = a4;
              B[j + 7][i + 3] = a5;
              for (k = i + 4; k < i + 8 && k < N; k++)
                  for (l = j + 4; l < j + 8 && l < M; l++)
                      B[l][k] = A[k][l];
          }
      }
  }
#+end_src

*** 61 × 67 (M = 61, N = 67)
    :PROPERTIES:
    :CUSTOM_ID: m-61-n-67
    :END:
61 × 67: 10 points if m < 2, 000, 0 points if m > 3, 000

不规则的matrix，本质也是用分块来优化Cache的读写，但是不能找到比较显然的规律看出来间隔多少可以填满一个Cache。但是由于要求比较松，因此无需考虑处理对角线，直接进行转置操作，仅尝试换用不同的边长分块即可。

#+begin_src C
  for (i = 0; i < N; i += (i % 36 ? 20 : 16)) {
      for (j = 0; j < M; j += 4) {
          for (k = i; k < i + (i % 36 ? 20 : 16) && k < N; k += 2) {
              if (j < M)
                  a0 = A[k][j];
              if (j + 1 < M)
                  a1 = A[k][j + 1];
              if (j + 2 < M)
                  a2 = A[k][j + 2];
              if (j + 3 < M)
                  a3 = A[k][j + 3];
              if (k + 1 < N) {
                  if (j < M)
                      a4 = A[k + 1][j];
                  if (j + 1 < M)
                      a5 = A[k + 1][j + 1];
                  if (j + 2 < M)
                      a6 = A[k + 1][j + 2];
                  if (j + 3 < M)
                      a7 = A[k + 1][j + 3];
              }
              if (j < M)
                  B[j][k] = a0;
              if (j + 1 < M)
                  B[j + 1][k] = a1;
              if (j + 2 < M)
                  B[j + 2][k] = a2;
              if (j + 3 < M)
                  B[j + 3][k] = a3;
              if (k + 1 < N) {
                  if (j < M)
                      B[j][k + 1] = a4;
                  if (j + 1 < M)
                      B[j + 1][k + 1] = a5;
                  if (j + 2 < M)
                      B[j + 2][k + 1] = a6;
                  if (j + 3 < M)
                      B[j + 3][k + 1] = a7;
              }
          }
      }
  }
#+end_src

* 代码
  :PROPERTIES:
  :CUSTOM_ID: 代码
  :END:
