Lab4-CacheLab/report/CACHELAB.html

<div id="outline-container-org1e56163" class="outline-4">
<h4 id="m-32-n-32"><a id="org1e56163"></a><span class="section-number-4">2.2.1</span> 32 × 32 (M = 32, N = 32)</h4>
<div class="outline-text-4" id="text-m-32-n-32">
<p>
32 × 32: 8 points if m &lt; 300, 0 points if m &gt; 600
</p>

<p>
对于32 * 32的矩阵，一次可以装下8行的值。于是用8 *
8的分块来处理，增加缓存命中。为了避免矩阵对角线访问问题，通过变量一次性读出A的一整行，再存入B。代码如下：
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #a020f0;">for</span> (i = 0; i &lt; N; i += 8) {
    <span style="color: #a020f0;">for</span> (j = 0; j &lt; M; j += 8) {
        <span style="color: #a020f0;">if</span> (i == j) {
            <span style="color: #a020f0;">for</span> (k = i; k &lt; i + 8 &amp;&amp; k &lt; N; k++) {
                a0 = A[k][j];
                a1 = A[k][j + 1];
                a2 = A[k][j + 2];
                a3 = A[k][j + 3];
                a4 = A[k][j + 4];
                a5 = A[k][j + 5];
                a6 = A[k][j + 6];
                a7 = A[k][j + 7];
                B[k][j] = a0;
                B[k][j + 1] = a1;
                B[k][j + 2] = a2;
                B[k][j + 3] = a3;
                B[k][j + 4] = a4;
                B[k][j + 5] = a5;
                B[k][j + 6] = a6;
                B[k][j + 7] = a7;
            }
            <span style="color: #a020f0;">for</span> (k = i; k &lt; i + 8 &amp;&amp; k &lt; N; k++) {
                <span style="color: #a020f0;">for</span> (l = k; l &lt; j + 8 &amp;&amp; l &lt; M; l++) {
                    a0 = B[l][k];
                    B[l][k] = B[k][l];
                    B[k][l] = a0;
                }
            }
        } <span style="color: #a020f0;">else</span> {
            <span style="color: #a020f0;">for</span> (k = i; k &lt; i + 8 &amp;&amp; k &lt; N; k++) {
                <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 8 &amp;&amp; l &lt; M; l++) {
                    B[l][k] = A[k][l];
                }
            }
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d22315" class="outline-4">
<h4 id="m-64-n-64"><a id="org7d22315"></a><span class="section-number-4">2.2.2</span> 64 × 64 (M = 64, N = 64)</h4>
<div class="outline-text-4" id="text-m-64-n-64">
<p>
64 × 64: 8 points if m &lt; 1, 300, 0 points if m &gt; 2, 000
</p>

<p>
还是考虑 8 * 8 分块的情况，不过这一次是在分块内再次分块成 4 个 4 * 4 分
块，分别处理这 4 个分块。
</p>

<p>
首先对左上角和右上角进行处理：
</p>

<ol class="org-ol">
<li>B左上角 = A左上角转置。B右上角=A右上角转置。</li>
<li>我们最后只需要把这部分平移到B的左下角就好。</li>
</ol>

<p>
现在B左上角完成
</p>

<ol class="org-ol">
<li>首先用四个变量存储A的左下角的一列。</li>
<li>再用四个变量存储B的右上角的一行。</li>
<li>把四个变量存储的A的左下角的一列移动到B右上角的一行</li>
<li>把四个变量存储的B的右上角的一行平移到B左下角的一列</li>
<li>B的右下角=A的右下角转置</li>
</ol>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #a020f0;">for</span> (j = 0; j &lt; M; j += 8) {
    i = !(j &gt;&gt; 5) &lt;&lt; 5;
    <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 8 &amp;&amp; l &lt; M; l++)
        <span style="color: #a020f0;">for</span> (k = j; k &lt; j + 4 &amp;&amp; k &lt; N; k++)
            B[k][i + l - j] = A[k][l];
    <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 8 &amp;&amp; l &lt; M; l++)
        <span style="color: #a020f0;">for</span> (k = j + 4; k &lt; j + 8 &amp;&amp; k &lt; N; k++)
            B[k - 4][i + l - j + 8] = A[k][l];
    <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 4 &amp;&amp; l &lt; M; l++) {
        <span style="color: #a020f0;">for</span> (k = j; k &lt; j + 4 &amp;&amp; k &lt; N; k++)
            B[l][k] = B[k][i + l - j];
        <span style="color: #a020f0;">for</span> (k = j + 4; k &lt; j + 8 &amp;&amp; k &lt; N; k++)
            B[l][k] = B[k - 4][i + l - j + 8];
    }
    <span style="color: #a020f0;">for</span> (l = j + 4; l &lt; j + 8 &amp;&amp; l &lt; M; l++) {
        <span style="color: #a020f0;">for</span> (k = j; k &lt; j + 4 &amp;&amp; k &lt; N; k++)
            B[l][k] = B[k][i + l - j];
        <span style="color: #a020f0;">for</span> (k = j + 4; k &lt; j + 8 &amp;&amp; k &lt; N; k++)
            B[l][k] = B[k - 4][i + l - j + 8];
    }
    <span style="color: #a020f0;">for</span> (i = 0; i &lt; N; i += 8) {
        <span style="color: #a020f0;">if</span> (i != j) {
            <span style="color: #a020f0;">for</span> (k = i; k &lt; i + 2 &amp;&amp; k &lt; N; k++)
                <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 4 &amp;&amp; l &lt; M; l++)
                    B[l][k] = A[k][l];
            a0 = A[i][j + 4];
            a1 = A[i][j + 5];
            a2 = A[i][j + 6];
            a3 = A[i][j + 7];
            a4 = A[i + 1][j + 4];
            a5 = A[i + 1][j + 5];
            a6 = A[i + 1][j + 6];
            a7 = A[i + 1][j + 7];
            <span style="color: #a020f0;">for</span> (k = i + 2; k &lt; i + 4 &amp;&amp; k &lt; N; k++) {
                <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 4 &amp;&amp; l &lt; M; l++)
                    B[l][k] = A[k][l];
                <span style="color: #a020f0;">for</span> (l = j + 4; l &lt; j + 8 &amp;&amp; l &lt; M; l++)
                    B[k - i + j][l - j + i] = A[k][l];
            }
            <span style="color: #a020f0;">for</span> (k = i + 4; k &lt; i + 8 &amp;&amp; k &lt; N; k++)
                <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 2 &amp;&amp; l &lt; M; l++)
                    B[l][k] = A[k][l];
            <span style="color: #a020f0;">for</span> (k = i + 2; k &lt; i + 4 &amp;&amp; k &lt; N; k++)
                <span style="color: #a020f0;">for</span> (l = j + 4; l &lt; j + 6 &amp;&amp; l &lt; M; l++)
                    B[l][k] = B[k - i + j][l - j + i];
            B[j + 4][i] = a0;
            B[j + 5][i] = a1;
            B[j + 4][i + 1] = a4;
            B[j + 5][i + 1] = a5;
            a0 = B[j + 2][i + 6];
            a1 = B[j + 2][i + 7];
            a4 = B[j + 3][i + 6];
            a5 = B[j + 3][i + 7];
            <span style="color: #a020f0;">for</span> (k = i + 4; k &lt; i + 8 &amp;&amp; k &lt; N; k++)
                <span style="color: #a020f0;">for</span> (l = j + 2; l &lt; j + 4 &amp;&amp; l &lt; M; l++)
                    B[l][k] = A[k][l];
            B[j + 6][i] = a2;
            B[j + 7][i] = a3;
            B[j + 6][i + 1] = a6;
            B[j + 7][i + 1] = a7;
            B[j + 6][i + 2] = a0;
            B[j + 7][i + 2] = a1;
            B[j + 6][i + 3] = a4;
            B[j + 7][i + 3] = a5;
            <span style="color: #a020f0;">for</span> (k = i + 4; k &lt; i + 8 &amp;&amp; k &lt; N; k++)
                <span style="color: #a020f0;">for</span> (l = j + 4; l &lt; j + 8 &amp;&amp; l &lt; M; l++)
                    B[l][k] = A[k][l];
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga01b131" class="outline-4">
<h4 id="m-61-n-67"><a id="orga01b131"></a><span class="section-number-4">2.2.3</span> 61 × 67 (M = 61, N = 67)</h4>
<div class="outline-text-4" id="text-m-61-n-67">
<p>
61 × 67: 10 points if m &lt; 2, 000, 0 points if m &gt; 3, 000
</p>

<p>
不规则的matrix，本质也是用分块来优化Cache的读写，但是不能找到比较显然的规律看出来间隔多少可以填满一个Cache。但是由于要求比较松，因此无需考虑处理对角线，直接进行转置操作，仅尝试换用不同的边长分块即可。
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #a020f0;">for</span> (i = 0; i &lt; N; i += (i % 36 ? 20 : 16)) {
    <span style="color: #a020f0;">for</span> (j = 0; j &lt; M; j += 4) {
        <span style="color: #a020f0;">for</span> (k = i; k &lt; i + (i % 36 ? 20 : 16) &amp;&amp; k &lt; N; k += 2) {
            <span style="color: #a020f0;">if</span> (j &lt; M)
                a0 = A[k][j];
            <span style="color: #a020f0;">if</span> (j + 1 &lt; M)
                a1 = A[k][j + 1];
            <span style="color: #a020f0;">if</span> (j + 2 &lt; M)
                a2 = A[k][j + 2];
            <span style="color: #a020f0;">if</span> (j + 3 &lt; M)
                a3 = A[k][j + 3];
            <span style="color: #a020f0;">if</span> (k + 1 &lt; N) {
                <span style="color: #a020f0;">if</span> (j &lt; M)
                    a4 = A[k + 1][j];
                <span style="color: #a020f0;">if</span> (j + 1 &lt; M)
                    a5 = A[k + 1][j + 1];
                <span style="color: #a020f0;">if</span> (j + 2 &lt; M)
                    a6 = A[k + 1][j + 2];
                <span style="color: #a020f0;">if</span> (j + 3 &lt; M)
                    a7 = A[k + 1][j + 3];
            }
            <span style="color: #a020f0;">if</span> (j &lt; M)
                B[j][k] = a0;
            <span style="color: #a020f0;">if</span> (j + 1 &lt; M)
                B[j + 1][k] = a1;
            <span style="color: #a020f0;">if</span> (j + 2 &lt; M)
                B[j + 2][k] = a2;
            <span style="color: #a020f0;">if</span> (j + 3 &lt; M)
                B[j + 3][k] = a3;
            <span style="color: #a020f0;">if</span> (k + 1 &lt; N) {
                <span style="color: #a020f0;">if</span> (j &lt; M)
                    B[j][k + 1] = a4;
                <span style="color: #a020f0;">if</span> (j + 1 &lt; M)
                    B[j + 1][k + 1] = a5;
                <span style="color: #a020f0;">if</span> (j + 2 &lt; M)
                    B[j + 2][k + 1] = a6;
                <span style="color: #a020f0;">if</span> (j + 3 &lt; M)
                    B[j + 3][k + 1] = a7;
            }
        }
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
