Lab4-CacheLab/report/CACHELAB.org
** Part A: Writing a Cache Simulator
   :PROPERTIES:
   :CUSTOM_ID: part-a-writing-a-cache-simulator-1
   :END:
#+begin_src C
  #include "cachelab.h"
  #include <stdio.h>
  #include <stdlib.h>
  #include <string.h>
  #include <unistd.h>
  #include <getopt.h>

  int s, E, b;
  FILE *f;
  int hit, miss, eviction;
  typedef struct
  {
      int usedtime;
      unsigned tag;
  } block;
  block *cache;

  void find(unsigned addr, int time)
  {
      unsigned tag = addr >> b >> s;
      int setindex = addr >> b ^ (tag << s);
      block *cacherow = cache + E * setindex;
      block *evictionrow = cacherow;
      for (int i = 0; i < E; i++)
      {
          if (cacherow[i].usedtime && cacherow[i].tag == tag)
          {
              cacherow[i].usedtime = time;
              hit++;
              return;
          }
          else if (!cacherow[i].usedtime)
          {
              miss++;
              cacherow[i].usedtime = time;
              cacherow[i].tag = tag;
              return;
          }
          else if (cacherow[i].usedtime < evictionrow->usedtime)
              evictionrow = cacherow + i;
      }
      miss++;
      eviction++;
      evictionrow->usedtime = time;
      evictionrow->tag = tag;
  }

  void print_usage()
  {
      printf("Usage: ./csim [-hv] -s <num> -E <num> -b <num> -t <file>\n");
      printf("Options\n");
      printf("  -h        Print this help message.\n");
      printf("  -v        Optional verbose flag.\n");
      printf("  -s <num>: Number of set index bits.\n");
      printf("  -E <num>: Number of lines per set.\n");
      printf("  -b <num>: Number of block offset bits.\n");
      printf("  -t <file>: Trace file.\n");
      printf("\n");
      printf("Exampes:\n");
      printf("  linux> ./csim -s 4 -E 1 -b 4 -t traces/yi.trace\n");
      printf("  linux> ./csim -v -s 8 -E 2 -b 4 -t traces/yi.trace\n");
  }

  int main(int argc, char *argv[])
  {
      int opt;
      char op;
      unsigned addr;
      int t = 0;
      while ((opt = getopt(argc, argv, "hvs:E:b:t:")) != -1)
      {
          switch (opt)
          {
          case 'h':
              print_usage();
              exit(0);
          case 'v':
              // v = 1;
              break;
          case 's':
              s = atoi(optarg);
              break;
          case 'E':
              E = atoi(optarg);
              break;
          case 'b':
              b = atoi(optarg);
              break;
          case 't':
              f = fopen(optarg, "r");
              break;
          }
      }
      cache = (block *)malloc(sizeof(block) * E << s);
      memset(cache, 0, sizeof(block) * E << s);
      while (fscanf(f, "%s%x,%*d\n", &op, &addr) > 0)
      {
          switch (op)
          {
          case 'M':
              hit++;
          case 'L':
          case 'S':
              find(addr, ++t);
          }
      }
      fclose(f);
      free(cache);
      printSummary(hit, miss, eviction);
      return 0;
  }
#+end_src

