Lab4-CacheLab/report/CACHELAB.html

<div id="outline-container-org3149257" class="outline-2">
<h2 id="代码"><a id="org3149257"></a><span class="section-number-2">3</span> 代码</h2>
<div class="outline-text-2" id="text-代码">
</div>
<div id="outline-container-org0380e76" class="outline-3">
<h3 id="part-a-writing-a-cache-simulator-1"><a id="org0380e76"></a><span class="section-number-3">3.1</span> Part A: Writing a Cache Simulator</h3>
<div class="outline-text-3" id="text-part-a-writing-a-cache-simulator-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"cachelab.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;unistd.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;getopt.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #a0522d;">s</span>, <span style="color: #a0522d;">E</span>, <span style="color: #a0522d;">b</span>;
<span style="color: #228b22;">FILE</span> *<span style="color: #a0522d;">f</span>;
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">hit</span>, <span style="color: #a0522d;">miss</span>, <span style="color: #a0522d;">eviction</span>;
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span>
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">usedtime</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">tag</span>;
} <span style="color: #228b22;">block</span>;
<span style="color: #228b22;">block</span> *<span style="color: #a0522d;">cache</span>;

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">find</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">addr</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">time</span>)
{
    <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">tag</span> = addr &gt;&gt; b &gt;&gt; s;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">setindex</span> = addr &gt;&gt; b ^ (tag &lt;&lt; s);
    <span style="color: #228b22;">block</span> *<span style="color: #a0522d;">cacherow</span> = cache + E * setindex;
    <span style="color: #228b22;">block</span> *<span style="color: #a0522d;">evictionrow</span> = cacherow;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0; i &lt; E; i++)
    {
        <span style="color: #a020f0;">if</span> (cacherow[i].usedtime &amp;&amp; cacherow[i].tag == tag)
        {
            cacherow[i].usedtime = time;
            hit++;
            <span style="color: #a020f0;">return</span>;
        }
        <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (!cacherow[i].usedtime)
        {
            miss++;
            cacherow[i].usedtime = time;
            cacherow[i].tag = tag;
            <span style="color: #a020f0;">return</span>;
        }
        <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (cacherow[i].usedtime &lt; evictionrow-&gt;usedtime)
            evictionrow = cacherow + i;
    }
    miss++;
    eviction++;
    evictionrow-&gt;usedtime = time;
    evictionrow-&gt;tag = tag;
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">print_usage</span>()
{
    printf(<span style="color: #8b2252;">"Usage: ./csim [-hv] -s &lt;num&gt; -E &lt;num&gt; -b &lt;num&gt; -t &lt;file&gt;\n"</span>);
    printf(<span style="color: #8b2252;">"Options\n"</span>);
    printf(<span style="color: #8b2252;">"  -h        Print this help message.\n"</span>);
    printf(<span style="color: #8b2252;">"  -v        Optional verbose flag.\n"</span>);
    printf(<span style="color: #8b2252;">"  -s &lt;num&gt;: Number of set index bits.\n"</span>);
    printf(<span style="color: #8b2252;">"  -E &lt;num&gt;: Number of lines per set.\n"</span>);
    printf(<span style="color: #8b2252;">"  -b &lt;num&gt;: Number of block offset bits.\n"</span>);
    printf(<span style="color: #8b2252;">"  -t &lt;file&gt;: Trace file.\n"</span>);
    printf(<span style="color: #8b2252;">"\n"</span>);
    printf(<span style="color: #8b2252;">"Exampes:\n"</span>);
    printf(<span style="color: #8b2252;">"  linux&gt; ./csim -s 4 -E 1 -b 4 -t traces/yi.trace\n"</span>);
    printf(<span style="color: #8b2252;">"  linux&gt; ./csim -v -s 8 -E 2 -b 4 -t traces/yi.trace\n"</span>);
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">opt</span>;
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">op</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">addr</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">t</span> = 0;
    <span style="color: #a020f0;">while</span> ((opt = getopt(argc, argv, <span style="color: #8b2252;">"hvs:E:b:t:"</span>)) != -1)
    {
        <span style="color: #a020f0;">switch</span> (opt)
        {
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'h'</span>:
            print_usage();
            exit(0);
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'v'</span>:
            <span style="color: #b22222;">// </span><span style="color: #b22222;">v = 1;</span>
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'s'</span>:
            s = atoi(optarg);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'E'</span>:
            E = atoi(optarg);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'b'</span>:
            b = atoi(optarg);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'t'</span>:
            f = fopen(optarg, <span style="color: #8b2252;">"r"</span>);
            <span style="color: #a020f0;">break</span>;
        }
    }
    cache = (<span style="color: #228b22;">block</span> *)malloc(<span style="color: #a020f0;">sizeof</span>(block) * E &lt;&lt; s);
    memset(cache, 0, <span style="color: #a020f0;">sizeof</span>(block) * E &lt;&lt; s);
    <span style="color: #a020f0;">while</span> (fscanf(f, <span style="color: #8b2252;">"%s%x,%*d\n"</span>, &amp;op, &amp;addr) &gt; 0)
    {
        <span style="color: #a020f0;">switch</span> (op)
        {
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'M'</span>:
            hit++;
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'L'</span>:
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'S'</span>:
            find(addr, ++t);
        }
    }
    fclose(f);
    free(cache);
    printSummary(hit, miss, eviction);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>
