Lab4-CacheLab/report/CACHELAB.html

<div id="outline-container-org0a07032" class="outline-3">
<h3 id="part-boptimizing-matrix-transpose-1"><a id="org0a07032"></a><span class="section-number-3">3.2</span> Part B：Optimizing Matrix Transpose</h3>
<div class="outline-text-3" id="text-part-boptimizing-matrix-transpose-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"cachelab.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"contracts.h"</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">is_transpose</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">M</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">N</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">A</span>[N][M], <span style="color: #228b22;">int</span> <span style="color: #a0522d;">B</span>[M][N]);

<span style="color: #b22222;">/* </span>
<span style="color: #b22222;"> * transpose_submit - This is the solution transpose function that you</span>
<span style="color: #b22222;"> *     will be graded on for Part B of the assignment. Do not change</span>
<span style="color: #b22222;"> *     the description string "Transpose submission", as the driver</span>
<span style="color: #b22222;"> *     searches for that string to identify the transpose function to</span>
<span style="color: #b22222;"> *     be graded. The REQUIRES and ENSURES from 15-122 are included</span>
<span style="color: #b22222;"> *     for your convenience. They can be removed if you like.</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>
<span style="color: #228b22;">char</span> <span style="color: #a0522d;">transpose_submit_desc</span>[] = <span style="color: #8b2252;">"Transpose submission"</span>;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">transpose_submit</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">M</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">N</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">A</span>[N][M], <span style="color: #228b22;">int</span> <span style="color: #a0522d;">B</span>[M][N])
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>, <span style="color: #a0522d;">j</span>, <span style="color: #a0522d;">k</span>, <span style="color: #a0522d;">l</span>, <span style="color: #a0522d;">a0</span>, <span style="color: #a0522d;">a1</span>, <span style="color: #a0522d;">a2</span>, <span style="color: #a0522d;">a3</span>, <span style="color: #a0522d;">a4</span>, <span style="color: #a0522d;">a5</span>, <span style="color: #a0522d;">a6</span>, <span style="color: #a0522d;">a7</span>;
    REQUIRES(M &gt; 0);
    REQUIRES(N &gt; 0);

    <span style="color: #a020f0;">if</span> (M == 61) {
        <span style="color: #a020f0;">for</span> (i = 0; i &lt; N; i += (i % 36 ? 20 : 16)) {
            <span style="color: #a020f0;">for</span> (j = 0; j &lt; M; j += 4) {
                <span style="color: #a020f0;">for</span> (k = i; k &lt; i + (i % 36 ? 20 : 16) &amp;&amp; k &lt; N; k += 2) {
                    <span style="color: #a020f0;">if</span> (j &lt; M)
                        a0 = A[k][j];
                    <span style="color: #a020f0;">if</span> (j + 1 &lt; M)
                        a1 = A[k][j + 1];
                    <span style="color: #a020f0;">if</span> (j + 2 &lt; M)
                        a2 = A[k][j + 2];
                    <span style="color: #a020f0;">if</span> (j + 3 &lt; M)
                        a3 = A[k][j + 3];
                    <span style="color: #a020f0;">if</span> (k + 1 &lt; N) {
                        <span style="color: #a020f0;">if</span> (j &lt; M)
                            a4 = A[k + 1][j];
                        <span style="color: #a020f0;">if</span> (j + 1 &lt; M)
                            a5 = A[k + 1][j + 1];
                        <span style="color: #a020f0;">if</span> (j + 2 &lt; M)
                            a6 = A[k + 1][j + 2];
                        <span style="color: #a020f0;">if</span> (j + 3 &lt; M)
                            a7 = A[k + 1][j + 3];
                    }
                    <span style="color: #a020f0;">if</span> (j &lt; M)
                        B[j][k] = a0;
                    <span style="color: #a020f0;">if</span> (j + 1 &lt; M)
                        B[j + 1][k] = a1;
                    <span style="color: #a020f0;">if</span> (j + 2 &lt; M)
                        B[j + 2][k] = a2;
                    <span style="color: #a020f0;">if</span> (j + 3 &lt; M)
                        B[j + 3][k] = a3;
                    <span style="color: #a020f0;">if</span> (k + 1 &lt; N) {
                        <span style="color: #a020f0;">if</span> (j &lt; M)
                            B[j][k + 1] = a4;
                        <span style="color: #a020f0;">if</span> (j + 1 &lt; M)
                            B[j + 1][k + 1] = a5;
                        <span style="color: #a020f0;">if</span> (j + 2 &lt; M)
                            B[j + 2][k + 1] = a6;
                        <span style="color: #a020f0;">if</span> (j + 3 &lt; M)
                            B[j + 3][k + 1] = a7;
                    }
                }
            }
        }
    } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (M == 32) {
        <span style="color: #a020f0;">for</span> (i = 0; i &lt; N; i += 8) {
            <span style="color: #a020f0;">for</span> (j = 0; j &lt; M; j += 8) {
                <span style="color: #a020f0;">if</span> (i == j) {
                    <span style="color: #a020f0;">for</span> (k = i; k &lt; i + 8 &amp;&amp; k &lt; N; k++) {
                        a0 = A[k][j];
                        a1 = A[k][j + 1];
                        a2 = A[k][j + 2];
                        a3 = A[k][j + 3];
                        a4 = A[k][j + 4];
                        a5 = A[k][j + 5];
                        a6 = A[k][j + 6];
                        a7 = A[k][j + 7];
                        B[k][j] = a0;
                        B[k][j + 1] = a1;
                        B[k][j + 2] = a2;
                        B[k][j + 3] = a3;
                        B[k][j + 4] = a4;
                        B[k][j + 5] = a5;
                        B[k][j + 6] = a6;
                        B[k][j + 7] = a7;
                    }
                    <span style="color: #a020f0;">for</span> (k = i; k &lt; i + 8 &amp;&amp; k &lt; N; k++) {
                        <span style="color: #a020f0;">for</span> (l = k; l &lt; j + 8 &amp;&amp; l &lt; M; l++) {
                            a0 = B[l][k];
                            B[l][k] = B[k][l];
                            B[k][l] = a0;
                        }
                    }
                } <span style="color: #a020f0;">else</span> {
                    <span style="color: #a020f0;">for</span> (k = i; k &lt; i + 8 &amp;&amp; k &lt; N; k++) {
                        <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 8 &amp;&amp; l &lt; M; l++) {
                            B[l][k] = A[k][l];
                        }
                    }
                }
            }
        }
    } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (M == 64) {
        <span style="color: #a020f0;">for</span> (j = 0; j &lt; M; j += 8) {
            i = !(j &gt;&gt; 5) &lt;&lt; 5;
            <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 8 &amp;&amp; l &lt; M; l++)
                <span style="color: #a020f0;">for</span> (k = j; k &lt; j + 4 &amp;&amp; k &lt; N; k++)
                    B[k][i + l - j] = A[k][l];
            <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 8 &amp;&amp; l &lt; M; l++)
                <span style="color: #a020f0;">for</span> (k = j + 4; k &lt; j + 8 &amp;&amp; k &lt; N; k++)
                    B[k - 4][i + l - j + 8] = A[k][l];
            <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 4 &amp;&amp; l &lt; M; l++) {
                <span style="color: #a020f0;">for</span> (k = j; k &lt; j + 4 &amp;&amp; k &lt; N; k++)
                    B[l][k] = B[k][i + l - j];
                <span style="color: #a020f0;">for</span> (k = j + 4; k &lt; j + 8 &amp;&amp; k &lt; N; k++)
                    B[l][k] = B[k - 4][i + l - j + 8];
            }
            <span style="color: #a020f0;">for</span> (l = j + 4; l &lt; j + 8 &amp;&amp; l &lt; M; l++) {
                <span style="color: #a020f0;">for</span> (k = j; k &lt; j + 4 &amp;&amp; k &lt; N; k++)
                    B[l][k] = B[k][i + l - j];
                <span style="color: #a020f0;">for</span> (k = j + 4; k &lt; j + 8 &amp;&amp; k &lt; N; k++)
                    B[l][k] = B[k - 4][i + l - j + 8];
            }
            <span style="color: #a020f0;">for</span> (i = 0; i &lt; N; i += 8) {
                <span style="color: #a020f0;">if</span> (i != j) {
                    <span style="color: #a020f0;">for</span> (k = i; k &lt; i + 2 &amp;&amp; k &lt; N; k++)
                        <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 4 &amp;&amp; l &lt; M; l++)
                            B[l][k] = A[k][l];
                    a0 = A[i][j + 4];
                    a1 = A[i][j + 5];
                    a2 = A[i][j + 6];
                    a3 = A[i][j + 7];
                    a4 = A[i + 1][j + 4];
                    a5 = A[i + 1][j + 5];
                    a6 = A[i + 1][j + 6];
                    a7 = A[i + 1][j + 7];
                    <span style="color: #a020f0;">for</span> (k = i + 2; k &lt; i + 4 &amp;&amp; k &lt; N; k++) {
                        <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 4 &amp;&amp; l &lt; M; l++)
                            B[l][k] = A[k][l];
                        <span style="color: #a020f0;">for</span> (l = j + 4; l &lt; j + 8 &amp;&amp; l &lt; M; l++)
                            B[k - i + j][l - j + i] = A[k][l];
                    }
                    <span style="color: #a020f0;">for</span> (k = i + 4; k &lt; i + 8 &amp;&amp; k &lt; N; k++)
                        <span style="color: #a020f0;">for</span> (l = j; l &lt; j + 2 &amp;&amp; l &lt; M; l++)
                            B[l][k] = A[k][l];
                    <span style="color: #a020f0;">for</span> (k = i + 2; k &lt; i + 4 &amp;&amp; k &lt; N; k++)
                        <span style="color: #a020f0;">for</span> (l = j + 4; l &lt; j + 6 &amp;&amp; l &lt; M; l++)
                            B[l][k] = B[k - i + j][l - j + i];
                    B[j + 4][i] = a0;
                    B[j + 5][i] = a1;
                    B[j + 4][i + 1] = a4;
                    B[j + 5][i + 1] = a5;
                    a0 = B[j + 2][i + 6];
                    a1 = B[j + 2][i + 7];
                    a4 = B[j + 3][i + 6];
                    a5 = B[j + 3][i + 7];
                    <span style="color: #a020f0;">for</span> (k = i + 4; k &lt; i + 8 &amp;&amp; k &lt; N; k++)
                        <span style="color: #a020f0;">for</span> (l = j + 2; l &lt; j + 4 &amp;&amp; l &lt; M; l++)
                            B[l][k] = A[k][l];
                    B[j + 6][i] = a2;
                    B[j + 7][i] = a3;
                    B[j + 6][i + 1] = a6;
                    B[j + 7][i + 1] = a7;
                    B[j + 6][i + 2] = a0;
                    B[j + 7][i + 2] = a1;
                    B[j + 6][i + 3] = a4;
                    B[j + 7][i + 3] = a5;
                    <span style="color: #a020f0;">for</span> (k = i + 4; k &lt; i + 8 &amp;&amp; k &lt; N; k++)
                        <span style="color: #a020f0;">for</span> (l = j + 4; l &lt; j + 8 &amp;&amp; l &lt; M; l++)
                            B[l][k] = A[k][l];
                }
            }
        }
    }

    ENSURES(is_transpose(M, N, A, B));
}

<span style="color: #b22222;">/* </span>
<span style="color: #b22222;"> * You can define additional transpose functions below. We've defined</span>
<span style="color: #b22222;"> * a simple one below to help you get started. </span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span> 

<span style="color: #b22222;">/* </span>
<span style="color: #b22222;"> * trans - A simple baseline transpose function, not optimized for the cache.</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>
<span style="color: #228b22;">char</span> <span style="color: #a0522d;">trans_desc</span>[] = <span style="color: #8b2252;">"Simple row-wise scan transpose"</span>;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">trans</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">M</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">N</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">A</span>[N][M], <span style="color: #228b22;">int</span> <span style="color: #a0522d;">B</span>[M][N])
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>, <span style="color: #a0522d;">j</span>, <span style="color: #a0522d;">tmp</span>;

    REQUIRES(M &gt; 0);
    REQUIRES(N &gt; 0);

    <span style="color: #a020f0;">for</span> (i = 0; i &lt; N; i++) {
        <span style="color: #a020f0;">for</span> (j = 0; j &lt; M; j++) {
            tmp = A[i][j];
            B[j][i] = tmp;
        }
    }    

    ENSURES(is_transpose(M, N, A, B));
}

<span style="color: #b22222;">/*</span>
<span style="color: #b22222;"> * registerFunctions - This function registers your transpose</span>
<span style="color: #b22222;"> *     functions with the driver.  At runtime, the driver will</span>
<span style="color: #b22222;"> *     evaluate each of the registered functions and summarize their</span>
<span style="color: #b22222;"> *     performance. This is a handy way to experiment with different</span>
<span style="color: #b22222;"> *     transpose strategies.</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">registerFunctions</span>()
{
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Register your solution function </span><span style="color: #b22222;">*/</span>
    registerTransFunction(transpose_submit, transpose_submit_desc); 

    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Register any additional transpose functions </span><span style="color: #b22222;">*/</span>
    registerTransFunction(trans, trans_desc); 

}

<span style="color: #b22222;">/* </span>
<span style="color: #b22222;"> * is_transpose - This helper function checks if B is the transpose of</span>
<span style="color: #b22222;"> *     A. You can check the correctness of your transpose by calling</span>
<span style="color: #b22222;"> *     it before returning from the transpose function.</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">is_transpose</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">M</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">N</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">A</span>[N][M], <span style="color: #228b22;">int</span> <span style="color: #a0522d;">B</span>[M][N])
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>, <span style="color: #a0522d;">j</span>;

    <span style="color: #a020f0;">for</span> (i = 0; i &lt; N; i++) {
        <span style="color: #a020f0;">for</span> (j = 0; j &lt; M; ++j) {
            <span style="color: #a020f0;">if</span> (A[i][j] != B[j][i]) {
                <span style="color: #a020f0;">return</span> 0;
            }
        }
    }
    <span style="color: #a020f0;">return</span> 1;
}
</pre>
</div>
</div>
</div>
</div>
