Lab4-CacheLab/report/CACHELAB.org
* 运行结果与分析
  :PROPERTIES:
  :CUSTOM_ID: 运行结果与分析
  :END:
#+begin_src shell
  # yaaannn @ YAAANNN-PC in ~/Documents/ICSLAB/cachelab [14:44:07] 
  $ python2 driver.py
  Part A: Testing cache simulator
  Running ./test-csim
                          Your simulator     Reference simulator
  Points (s,E,b)    Hits  Misses  Evicts    Hits  Misses  Evicts
       3 (1,1,1)       9       8       6       9       8       6  traces/yi2.trace
       3 (4,2,4)       4       5       2       4       5       2  traces/yi.trace
       3 (2,1,4)       2       3       1       2       3       1  traces/dave.trace
       3 (2,1,3)     167      71      67     167      71      67  traces/trans.trace
       3 (2,2,3)     201      37      29     201      37      29  traces/trans.trace
       3 (2,4,3)     212      26      10     212      26      10  traces/trans.trace
       3 (5,1,5)     231       7       0     231       7       0  traces/trans.trace
       6 (5,1,5)  265189   21775   21743  265189   21775   21743  traces/long.trace
      27


  Part B: Testing transpose function
  Running ./test-trans -M 32 -N 32
  Running ./test-trans -M 64 -N 64
  Running ./test-trans -M 61 -N 67

  Cache Lab summary:
                          Points   Max pts      Misses
  Csim correctness          27.0        27
  Trans perf 32x32           8.0         8     invalid
  Trans perf 64x64           8.0         8        1027
  Trans perf 61x67          10.0        10        1692
            Total points    53.0        53
#+end_src

其中Cache模拟和矩阵转置均符合要求。
