Lab4-CacheLab/report/CACHELAB.html

<div id="outline-container-org5d6d950" class="outline-2">
<h2 id="运行结果与分析"><a id="org5d6d950"></a><span class="section-number-2">4</span> 运行结果与分析</h2>
<div class="outline-text-2" id="text-运行结果与分析">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">yaaannn @ YAAANNN-PC in ~/Documents/ICSLAB/cachelab [14:44:07] </span>
$ python2 driver.py
Part A: Testing cache simulator
Running ./test-csim
                        Your simulator     Reference simulator
<span style="color: #0000ff;">Points</span> (s,E,b)    Hits  Misses  Evicts    Hits  Misses  Evicts
     3 (1,1,1)       9       8       6       9       8       6  traces/yi2.trace
     3 (4,2,4)       4       5       2       4       5       2  traces/yi.trace
     3 (2,1,4)       2       3       1       2       3       1  traces/dave.trace
     3 (2,1,3)     167      71      67     167      71      67  traces/trans.trace
     3 (2,2,3)     201      37      29     201      37      29  traces/trans.trace
     3 (2,4,3)     212      26      10     212      26      10  traces/trans.trace
     3 (5,1,5)     231       7       0     231       7       0  traces/trans.trace
     6 (5,1,5)  265189   21775   21743  265189   21775   21743  traces/long.trace
    27


Part B: Testing transpose <span style="color: #a020f0;">function</span>
Running ./test-trans -M 32 -N 32
Running ./test-trans -M 64 -N 64
Running ./test-trans -M 61 -N 67

Cache Lab summary:
                        Points   Max pts      Misses
Csim correctness          27.0        27
Trans perf 32x32           8.0         8     invalid
Trans perf 64x64           8.0         8        1027
Trans perf 61x67          10.0        10        1692
          Total points    53.0        53
</pre>
</div>

<p>
其中Cache模拟和矩阵转置均符合要求。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 何岩, 199074277</p>
<p class="date">Created: 2021-10-21 Thu 08:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
